{
  "banner": {
    "bannerImg": "/images/kce/banner_management.jpg",
    "title": "Management Profile",
    "breadcrumb": [
      { "label": "Home", "href": "/" },
     
      { "label": "Management Profile" }
    ]
  },
  "leaders": [
    {
      "role": "Chairman",
      "name": "Dr. R. Vasanthakumar",
      "image": "https://kiic.in/file/wp-content/uploads/2024/06/Dr.-R.-Vasanthakumar-Managing-trustee.jpg",
      "reverse": false,
      "bio": [
        "Dr.R.Vasanthakumar, a charity donor equality excellence and our founder promoter, is the Chairman of Karpagam College of Engineering. An enterprising industrialist, he is the Chairman and Managing Director of Karpagam Industries Private Limited, Karpagam Yarns Private Limited, Karpagam Infrastructure Private Limited, that together employ over 2000 personnel.A Gold Medalist from the Madras University, he graduated with honors in Electrical & Electronics Engineering. It is probably his deep-rooted academic interest that fuelled Dr.R.Vasanthakumar’s endeavours in the field of education. Besides education, Dr.R.Vasanthakumar is a renowned name lending his assistance to philanthropic causes. Dr.R.Vasanthakumar’s noteworthy contributions have been rightly commended through several titles and recognitions.",
        "An Honorary Doctorate conferred on him by the Avinashilingam University in 2004 stands testimony to his role as an exemplary academician and an extraordinary philanthropist.He has served as President, COSIEMA (Coimbatore Sidco Industrial Estate Management Association) during 1998 and 2000 and Tamil Nadu Private College Management Association (Coimbatore Chapter) 2000-2002. He is also the President of ENFUSE (Energy & fuel user’s Association) Coimbatore Chapter"
      ]
    },
    {
      "role": "Chief Executive Officer",
      "name": "Er. K. Murugaiah",
      "image": "https://karpagamcollegeofengineering.github.io/KCE-ICIC2-23/assets/img/committee/Shri.%20K.%20Murugaiah.jpg",
      "reverse": true,
      "bio": [
        "Er.K.Murugaiah is the Chief Executive Officer of Karpagam University. A Member of the Board of Management of Karpagam Charity Trust / Karpagam University, he joined the Trust as Administrative Officer and since 1994, has been designated as the Chief Executive Officer. A Gold Medalist from the Madras University, his efforts have always been instrumental in taking Karpagam to greater heights.",
        "Er.K.Murugaiah is best credited for his role as main co-ordinator in coordinating the University Grants Commission inspection for conferment of University Status. As a steering committee member, he was responsible in co-coordinating the National Academic Accreditation Council works and getting the coveted Five Star status for the then Karpagam Arts and Science College from NAAC and also for getting Autonomous status. He has also worked as a steering committee member in coordinating the National Board of Accreditation (NBA) process for Engineering and Polytechnic College. He continues to be the Chief Coordinator for all the Inspection committee visits organized in the institutions. A keen advisor, Er.K.Murugaiah’s expertise is always solicited for creative and constructive implementation of various new techniques in teaching-learning process and other academic activities in all the institutions. A Project coordinator for various UGC funded projects; he is the Governing council member of all the educational institutions."
      ]
    },
    {
      "role": "Principal",
      "name": "Dr. P. Karthigaikumar",
      "image": "https://kce.ac.in/new/wp-content/uploads/2025/06/Princiapl-message-final-23.06.2025_page-0001-1.jpg",
      "reverse": false,
      "bio": [
        "Welcome to Karpagam College of Engineering! I'm honored to serve as Principal and lead our community of scholars. Our institution is dedicated in fostering innovation, creativity, and academic excellence, providing a supportive environment that empowers students to reach their full potential. Let's work together to achieve greatness! Karpagam College of Engineering is a hub for innovation and excellence, offering top-notch engineering and technology programs. Our state-of-the-art infrastructure and experienced faculty to create a conducive learning environment, emphasizing research, innovation, and industry collaboration to equip students with industry-relevant skills.",
        "Dr. Karthigaikumar P holds a Ph.D. in Information and Communication Engineering from Anna University, Chennai. With over 24 years of teaching experience, he has published more than 124 research papers in international journals and conferences. His research interests include VLSI design, network security, and image processing. He has guided 9 Ph.D. scholars and received the prestigious K.S. Krishnan Memorial Award from IETE in 2010. Notable achievements include securing Rs. 10.66 lakhs from AICTE for the MODROBS Scheme to modernize the Microwave Lab and Rs. 1.47 crore from DST for a groundbreaking project on spectroscopy-based plastic identification and sorting. Membership in ISTE ACEEE and IACSIT. His dedication to education and research continues to inspire students and faculty alike."
      ]
    }
  ],
  "sideMenu": {
    "active": "Management Profile"
  }
}
