{
  "banner": {
    "bannerImg": "/images/kce/banner_computer_technology.jpg",
    "title": "Training",
    "breadcrumb": [
      {
        "label": "Home",
        "href": "/"
      },

      {
        "label": "Training"
      }
    ]
  },

  "sections": [
    {
      "type": "split-image-content",
      "data": {
        "imagePosition": "right",
        "sectionbg": "section-bg1 ",

        "image": "/images/kce/image.jpg",
        "content": [
          {
            "type": "paragraph",
            "text": [
              "Karpagam College of Engineering is one among the Premier Autonomous Institutions in Coimbatore. Accredited by TCS, Wipro, CTS, Infosys, etc., The Placement and Training Cell has been playing a vital role in establishing wonderful job opportunities for final-year students. It acts as a bridge between the Organizations and college students. A wide range of our students got placed through Campus interviews every year.",
              "We are upholding ample placement opportunities throughout the years, so several companies are willing to engage with our campus for recruit process. Various students had placed in reputed companies like Infosys, cognizant, Wipro, Amazon, Zoho Corporation, Informatica, Cap Gemini, Accenture, Infinite, Purple Slate, Sandfits Foundries, Rently, Stanadyne, Tata Consultancy Services, Ultramain Software, and many others. Our students have been attending 3 assessment tests (AMCAT) conducted by Aspiring Minds as a practice to be familiar in the aptitude content as industry standards.",
              "A student will undergo an average of 250-300 hours of training during his entire stay on the campus. Experts are invited to train the students as per industry needs. Apart from external training, internal trainers and placed students are organizing the following activities for the non–placed students and junior students."
            ]
          }
        ]
      }
    },
    {
      "type": "split-image-content",
      "data": {
        "imagePosition": "left",
        "sectionbg": "bg-blue py-5 text-white",
        "textColor": "text-white",
        "image": "/images/kce/image.jpg",
        "content": [
          {
            "type": "title",
            "mainTi": "Student Centric Activities:"
          },
          {
            "type": "list",
            "items": [
              "Wipro offering TalentNext program to develop Full Stack Java skills.",
              "Wipro providing Wipro Future Skills program to develop skills in latest trending technologies.",
              "Cognizant offering Learning Portal to equip students in Salesforce and Cyber Security domain.",
              "Infosys offering InfyTq certification program.",
              "Virtusa offering Cellinium – Tool Training."
            ]
          }
        ]
      }
    },
    {
      "type": "split-image-content",
      "data": {
        "imagePosition": "right",
        "sectionbg": "section-bg1 ",

        "image": "/images/kce/image.jpg",
        "content": [
          {
            "type": "title",
            "mainTi": "Capacity development and skills enhancement activities organised:"
          },
          {
            "type": "list",
            "items": [
              "Soft skills",
              "Language and communication skills",
              "Life skills (Yoga, physical fitness, health and hygiene)",
              "Awareness of trends in technology"
            ]
          },
          {
            "type": "button",
            "text": "Know More",
            "href": "https://kce.ac.in/new/wp-content/uploads/2022/08/Capacity-development-and-skills-enhancement-activities-organised.pdf"
          }
        ]
      }
    }
  ]
}
